# Handling Missing Data in Pandas

In [1]:
import numpy as np
import pandas as pd

In [5]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]} # Creating Dict!

In [6]:
df = pd.DataFrame(d) # Creating DataFrame out of that Dict!

In [7]:
df # Printing the df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# Dropping Missing Data

In [8]:
df.dropna() # Using dropna() we can drop the rows by default with nan values

     A    B  C
0  1.0  5.0  1

In [10]:
df.dropna(axis=1) # To drop the columns change the axis to 1!

   C
0  1
1  2
2  3

Now we can specify a Threshold also, to control the dropping of data!

Example:

In [11]:
df # printing the df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [12]:
df.dropna(thresh=2) #this will not allow to drop the row which contained 2 value

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

# Filling Missing Data

In [14]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
df.fillna(value='Fill Value') # This will fill the nan places with Values Arg!

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

Now, Lets say you wanna fill the mean of the data in some particular na value

In [16]:
df['A'] # Printing A from df

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [17]:
df['A'].fillna(value=df['A'].mean()) # Filling mean of the data using fillna

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64